app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"
---
  def index
    @bookings = Booking.all

DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 2]]
---
  def destroy
    if @booking.nil?
      render json: { error: "Booking not found" }, status: :not_found
    elsif @booking.destroy

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_booking
    @booking = Booking.find_by(id: params[:id])