app/controllers/cabs_controller.rb

  def index
    @cabs = Cab.all
---
SELECT "cabs".* FROM "cabs"