app/models/booking.rb

  def validate_cab_availability
    if cab&.bookings&.any?
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."cab_id" = ? LIMIT ?  [["cab_id", 1], ["LIMIT", 1]]

  def validate_customer_booking
    if Booking.exists?(customer_name: customer_name)
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."customer_name" = ? LIMIT ?  [["customer_name", "John Doe"], ["LIMIT", 1]]